class Douae {
  String doae;
  int rept;

  Douae({required this.doae, required this.rept});
}

List<Douae> doaegroup = [
  Douae(
      doae:
          'أَصبَحْنا على فِطرةِ الإسلامِ، وعلى كَلِمةِ الإخلاصِ، وعلى دِينِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ، وعلى مِلَّةِ أبِينا إبراهيمَ، حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ',
      rept: 1),
  Douae(
      doae:
          'بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ',
      rept: 3),
  Douae(
      doae:
          'سبحانَ اللَّهِ وبحمدِه لا قوَّةَ إلَّا باللَّهِ/ ما شاءَ اللَّهُ كانَ وما لم يشأ لم يَكن/ أعلمُ أنَّ اللَّهَ على كلِّ شيءٍ قديرٌ وأنَّ اللَّهَ قد أحاطَ بِكلِّ شيءٍ علمًا',
      rept: 1),
  Douae(doae: 'سبحانَ اللَّهِ وبحمدِهِ', rept: 100),
  Douae(
      doae:
          'اللَّهمَّ بِكَ أصبَحنا، وبِكَ أمسَينا، وبِكَ نحيا وبِكَ نموتُ وإليكَ المصيرُ، وإذا أمسَى فليقُلْ: اللَّهمَّ بِكَ أمسَينا وبِكَ أصبَحنا وبِكَ نحيا وبِكَ نموتُ وإليكَ النُّشورُ',
      rept: 1),
  Douae(
      doae: 'رَضيتُ باللَّهِ ربًّا، وبالإسلامِ دينًا، وبِمُحمَّدٍ رسولًا',
      rept: 1),
  Douae(
      doae:
          'اللَّهمَّ عالِمَ الغَيبِ والشَّهادةِ، فاطرَ السَّمواتِ والأرضِ، رَبَّ كلِّ شيءٍ ومَليكَهُ، أشهدُ أن لا إلَهَ إلَّا أنتَ، أعوذُ بِكَ مِن شرِّ نفسي وشرِّ الشَّيطانِ وشِركِهِ، قلهُ إذا أصبَحتَ، وإذا أمسَيتَ، وإذا أخَذتَ مَضجعَكَ',
      rept: 1),
  Douae(
      doae:
          'اللَّهمَّ ما أصبحَ بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ',
      rept: 1),
  Douae(
      doae:
          'ًسُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ',
      rept: 3),
  Douae(
      doae:
          'حَسبيَ اللهُ لا إلهَ إلَّا هو، عليه تَوكَّلْتُ، وهو ربُّ العَرشِ العَظيمِ',
      rept: 7),
];

List<Douae> doaegroup1 = [
  Douae(
      doae:
          'بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ',
      rept: 3),
  Douae(
      doae:
          'رَضِيتُ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا، إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ',
      rept: 1),
  Douae(
      doae:
          'اللَّهمَّ بِكَ أمسَينا وبِكَ أصبَحنا وبِكَ نحيا وبِكَ نموتُ وإليكَ المصير',
      rept: 1),
  Douae(doae: 'سبحانَ اللَّهِ وبحمدِهِ', rept: 100),
  Douae(
      doae:
          'سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ',
      rept: 3),
  Douae(
      doae:
          'اللَّهُمَّ إنِّي أمسيت أُشهِدُك، وأُشهِدُ حَمَلةَ عَرشِكَ، ومَلائِكَتَك، وجميعَ خَلقِكَ: أنَّكَ أنتَ اللهُ لا إلهَ إلَّا أنتَ، وأنَّ مُحمَّدًا عبدُكَ ورسولُكَ',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد، فقد جاء في الحديث: مَن صلى عَلَيَّ حين يُصْبِحُ عَشْرًا، وحين يُمْسِي عَشْرًا، أَدْرَكَتْه شفاعتي يومَ القيامةِ',
      rept: 1),
  Douae(
      doae:
          'لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له له الملكُ وله الحمدُ وهو على كلِّ شيءٍ قديرٌ',
      rept: 1),
  Douae(
      doae:
          'ًسأمسَيْنا على فِطرةِ الإسلامِ وعلى كَلِمةِ الإخلاصِ وعلى دينِ نبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّم وعلى مِلَّةِ أبينا إبراهيمَ حنيفًا مسلمًا وما كان مِنَ المشركينَ',
      rept: 3),
  Douae(
      doae:
          'اللَّهمَّ ما أصبح بي مِن نعمةٍ أو بأحَدٍ مِن خَلْقِكَ، فمنكَ وحدَكَ لا شريكَ لكَ، فلَكَ الأمسىولكَ الشُّكرُ',
      rept: 7),
];

List<Douae> doaegroup2 = [
  Douae(
      doae:
          'اللهم إني أسألك خير هذه الليلة وخير ما فيها، وأعوذ بك من شر هذه الليلة  وشر ما فيها',
      rept: 1),
  Douae(
      doae:
          'اللهم أسلمت نفسي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجى منك إلا إليك، آمنت بكتابك الذي أنزلت، وبنبيك الذي أرسلت.',
      rept: 1),
  Douae(
      doae:
          'بسم الله وضعت جنبي، وبك أرفعه، إن أمسكت نفسي فارحمها، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين.',
      rept: 1),
  Douae(
      doae: 'اقرأ المعوذتين (قل أعوذ برب الفلق، وقل أعوذ برب الناس)', rept: 3),
  Douae(doae: 'اقرأ آخر آيتين من سورة البقرة', rept: 1),
  Douae(doae: 'سبح الله والحمد لله والله أكبر', rept: 33),
  Douae(
      doae:
          'اللهم اغفر لي ذنبي، وأخسئ شيطاني، وفك رهاني، واجعلني في الندى الأعلى.',
      rept: 1),
  Douae(
      doae:
          'الحمد لله الذي كفاني وآواني، وأطعمني وسقاني، والذي منّ عليّ فأفضل، والذي أعطاني فأجزل، الحمد لله على كل حال، اللهم رب كل شيء ومليكه، وإله كل شيء أعوذ بك من النار',
      rept: 1),
  Douae(
      doae:
          'اللَّهمَّ أنتَ خلَقْتَ نفسي وأنتَ تتوفَّاها، لك مماتُها ومحياها، اللَّهمَّ إنْ توفَّيْتَها فاغفِرْ لها وإنْ أحيَيْتَها فاحفَظْها، اللَّهمَّ إنِّي أسأَلُك العافيةَ.',
      rept: 1)
];
List<Douae> doaegroup3 = [
  Douae(
      doae: 'الحمد لله الذي عافاني في جسدي ورد علي روحي، وأذن لي بذكره.',
      rept: 1),
  Douae(
      doae: 'اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً.',
      rept: 1),
  Douae(
      doae:
          'اللهم اجعلني من الذاكرين الشاكرين الذابحين لربهم القانتين السابحين.',
      rept: 1),
  Douae(
      doae:
          'اللهم إني أصبحت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك، أنك أنت الله لا إله إلا أنت، وحدك لا شريك لك، وأن محمداً عبدك ورسولك',
      rept: 3),
  Douae(
      doae:
          'اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك.',
      rept: 1),
  Douae(
      doae:
          'اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت.',
      rept: 33),
  Douae(
      doae:
          'اللهم إني أسألك إيماناً دائماً، ونصراً قريباً، وعلماً نافعاً، ورزقاً واسعاً، وشفاءً من كل داء.',
      rept: 1)
];

List<Douae> doaegroup4 = [
  Douae(doae: 'بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ.', rept: 1),
  Douae(doae: 'الحَمْدُ لِلَّهِ الَّذِي جَعَلَ الْمَاءَ طَهُورًا.', rept: 1),
  Douae(
      doae:
          'أَشْهَدُ أَنْ لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ.',
      rept: 1),
  Douae(
      doae:
          'سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَٰهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ.',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ ثَبِّتْ قَلْبِي عَلَى الْإِيمَانِ وَاجْعَلْ لِسَانِي عَامِلًا بِالْحَقِّ وَاجْعَلْ فِي الْآخِرَةِ حَسَنَةً وَفِي الدُّنْيَا حَسَنَةً وَقِنِي عَذَابَ النَّارِ.',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ اجْعَلْنِي مِنَ الَّذِينَ يُؤْمِنُونَ بِكَ وَيَتَوَكَّلُونَ عَلَيْكَ وَيُحِبُّونَ الَّذِينَ يَتَوَكَّلُونَ عَلَيْكَ وَاجْعَلْنِي مِنَ الْمُتَوَكِّلِينَ عَلَيْكَ.',
      rept: 1),
];
List<Douae> doaegroup5 = [
  Douae(
      doae:
          'اللَّهُمَّ رَبَّ النَّاسِ، أَذْهِبِ الْبَأْسَ، وَاشْفِ أَنْتَ الشَّافِي، لا شِفَاءَ إِلا شِفَاؤُكَ، شِفَاءً لا يُغَادِرُ سَقَمًا',
      rept: 3),
  Douae(
      doae:
          'أَسْأَلُ اللَّهَ الْعَظِيمَ، رَبَّ الْعَرْشِ الْعَظِيمِ، أَنْ يَشْفِيَكَ',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ رَبَّ النَّاسِ، أَذْهِبِ الْبَأْسَ، وَاشْفِ أَنْتَ الشَّافِي، لا شِفَاءَ إِلا شِفَاؤُكَ، شِفَاءً لا يُغَادِرُ سَقَمًا',
      rept: 7),
  Douae(
      doae:
          'أَسْأَلُ اللَّهَ الْعَظِيمَ، رَبَّ الْعَرْشِ الْعَظِيمِ، أَنْ يَشْفِيَكَ',
      rept: 3),
  Douae(
      doae:
          'اللَّهُمَّ رَبَّ النَّاسِ، أَذْهِبِ الْبَأْسَ، اشْفِ أَنْتَ الشَّافِي، لا شِفَاءَ إِلا شِفَاؤُكَ، شِفَاءً لا يُغَادِرُ سَقَمًا',
      rept: 5),
];
List<Douae> doaegroup6 = [
  Douae(
      doae:
          'اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ ذَا الجَلَالِ وَالإِكْرَامِ',
      rept: 1),
  Douae(
      doae:
          'لا إلَهَ إلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، اللَّهُمَّ لا مَانِعَ لِما أَعْطَيْتَ، وَلَا مُعْطِيَ لِما مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ',
      rept: 1),
  Douae(
      doae:
          'لا إلَهَ إلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، لا حَوْلَ وَلَا قُوَّةَ إلَّا باللَّهِ، لا إلَهَ إلَّا اللَّهُ، وَلَا نَعْبُدُ إلَّا إيَّاهُ، له النِّعْمَةُ وَلَهُ الفَضْلُ، وَلَهُ الثَّنَاءُ الحَسَنُ، لا إلَهَ إلَّا اللَّهُ مُخْلِصِينَ له الدِّينَ ولو كَرِهَ الكَافِرُونَ',
      rept: 1),
  Douae(
      doae:
          'سلا إلَهَ إلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، لا حَوْلَ وَلَا قُوَّةَ إلَّا باللَّهِ، لا إلَهَ إلَّا اللَّهُ، وَلَا نَعْبُدُ إلَّا إيَّاهُ، له النِّعْمَةُ وَلَهُ الفَضْلُ، وَلَهُ الثَّنَاءُ الحَسَنُ، لا إلَهَ إلَّا اللَّهُ مُخْلِصِينَ له الدِّينَ ولو كَرِهَ الكَافِرُونَ',
      rept: 1),
  Douae(
      doae:
          'مَن سَبَّحَ اللَّهَ في دُبُرِ كُلِّ صَلاةٍ ثَلاثًا وثَلاثِينَ، وحَمِدَ اللَّهَ ثَلاثًا وثَلاثِينَ، وكَبَّرَ اللَّهَ ثَلاثًا وثَلاثِينَ، فَتْلِكَ تِسْعَةٌ وتِسْعُونَ، وقالَ: تَمامَ المِئَةِ: لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ وله الحَمْدُ وهو علَى كُلِّ شيءٍ قَدِيرٌ غُفِرَتْ خَطاياهُ وإنْ كانَتْ مِثْلَ زَبَدِ البَحْرِ',
      rept: 1),
  Douae(
      doae:
          'مُعَقِّباتٌ لا يَخِيبُ قائِلُهُنَّ، أوْ فاعِلُهُنَّ، ثَلاثٌ وثَلاثُونَ تَسْبِيحَةً، وثَلاثٌ وثَلاثُونَ تَحْمِيدَةً، وأَرْبَعٌ وثَلاثُونَ تَكْبِيرَةً، في دُبُرِ كُلِّ صَلاةٍ',
      rept: 1),
  Douae(
      doae:
          'يسبِّحُ أحدُكُم في دُبِرِ كلِّ صلاةٍ عشرًا ويحمَدُ عشرًا ويُكبِّرُ عشرًا فَهيَ خمسونَ ومائةٌ في اللِّسانِ وألفٌ وخَمسمائةٍ في الميزانِ',
      rept: 1),
];
List<Douae> doaegroup7 = [
  Douae(
      doae:
          'أَسْتَغْفِرُ اللَّهَ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ',
      rept: 100),
  Douae(
      doae:
          'رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ',
      rept: 100),
  Douae(
      doae:
          'اللَّهُمَّ إِنِّي أَسْتَغْفِرُكَ مِنْ جَمِيعِ الذُّنُوبِ وَالْخَطَايَا وَأَتُوبُ إِلَيْكَ',
      rept: 100),
];
List<Douae> doaegroup8 = [
  Douae(
      doae:
          'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ الْيَوْمِ، فَتْحَهُ وَنَصْرَهُ، وَنُورَهُ وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا',
      rept: 1),
];
List<Douae> doaegroup9 = [
  Douae(doae: 'سبحان الله', rept: 33),
  Douae(doae: 'الحمد لله', rept: 33),
  Douae(doae: 'الله أكبر', rept: 33),
  Douae(
      doae:
          'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير',
      rept: 1),
];
List<Douae> doaegroup10 = [
  Douae(
      doae: 'أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه',
      rept: 3),
  Douae(doae: 'أستغفر الله العظيم من كل ذنبٍ عظيم', rept: 3),
  Douae(
      doae: 'أستغفر الله العظيم الذي لا إله إلا هو الرحمن الرحيم وأتوب إليه',
      rept: 3),
  Douae(doae: 'أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه', rept: 3),
  Douae(doae: 'أستغفر الله', rept: 100),
];
List<Douae> doaegroup11 = [
  Douae(doae: 'اللهُ أكبَرُ', rept: 3),
  Douae(
      doae:
          'سُبْحَانَ الذي سَخَّرَ لَنَا هذا، وَما كُنَّا له مُقْرِنِينَ، وإنَّا إلى رَبِّنَا لَمُنْقَلِبُونَ، اللَّهُمَّ إنَّا نَسْأَلُكَ في سَفَرِنَا هذا البِرَّ وَالتَّقْوَى، وَمِنَ العَمَلِ ما تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هذا، وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ في السَّفَرِ، وَالْخَلِيفَةُ في الأهْلِ، اللَّهُمَّ إنِّي أَعُوذُ بكَ مِن وَعْثَاءِ السَّفَرِ، وَكَآبَةِ المَنْظَرِ، وَسُوءِ المُنْقَلَبِ في المَالِ وَالأهْلِ، وإذَا رَجَعَ قالَهُنَّ، وَزَادَ فِيهِنَّ: آيِبُونَ تَائِبُونَ عَابِدُونَ، لِرَبِّنَا حَامِدُونَ',
      rept: 3),
  Douae(
      doae:
          'سُبْحانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ* وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ',
      rept: 1),
  Douae(
      doae:
          'اللهم أصحبنَا بنُصحكَ واقلبْنا بذمّةٍ، اللهم ازْوِ لنا الأرضَ وهوِّنْ علينا السفرَ',
      rept: 1),
  Douae(doae: 'أعوذُ بِكلماتِ اللهِ التَّامَّاتِ من شرِّ ما خَلقَ', rept: 1)
];

List<Douae> doaegroup12 = [
  Douae(
      doae:
          'اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الهَمِّ والحَزَنِ، والعَجْزِ والكَسَلِ، والجُبْنِ والبُخْلِ، وضَلَعِ الدَّيْنِ، وغَلَبَةِ الرِّجالِ',
      rept: 1),
  Douae(
      doae:
          'اللَّهمَّ اكفني بِحلالِكَ عن حرامِكَ، وأغنِني بِفَضلِكَ عَمن سواكَ',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الأرْضِ وَرَبَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بكَ مِن شَرِّ كُلِّ شيءٍ أَنْتَ آخِذٌ بنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فليسَ قَبْلَكَ شيءٌ، وَأَنْتَ الآخِرُ فليسَ بَعْدَكَ شيءٌ، وَأَنْتَ الظَّاهِرُ فليسَ فَوْقَكَ شيءٌ، وَأَنْتَ البَاطِنُ فليسَ دُونَكَ شيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ           ',
      rept: 1),
  Douae(
      doae:
          'اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الكَسَلِ والهَرَمِ، والمَأْثَمِ والمَغْرَمِ، ومِنْ فِتْنَةِ القَبْرِ، وعَذابِ القَبْرِ، ومِنْ فِتْنَةِ النَّارِ وعَذابِ النَّارِ، ومِنْ شَرِّ فِتْنَةِ الغِنَى، وأَعُوذُ بكَ مِن فِتْنَةِ الفَقْرِ',
      rept: 1)
];
